app/controllers/api/v1/airlines_controller.rb

SELECT "airlines".* FROM "airlines"
---
			def index
				airlines = Airline.all

SELECT  "airlines".* FROM "airlines" WHERE "airlines"."slug" = $1 LIMIT $2  [["slug", "united-airlines"], ["LIMIT", 1]]
---
			def show
				airline = Airline.find_by(slug: params[:slug])

INSERT INTO "airlines" ("name", "slug", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "fake airline"], ["slug", "fake-airline"], ["created_at", "2020-09-20 03:24:52.761373"], ["updated_at", "2020-09-20 03:24:52.761373"]]
---
			def create
				airline = Airline.new(airline_params)

				if airline.save

SELECT  "airlines".* FROM "airlines" WHERE "airlines"."slug" = $1 LIMIT $2  [["slug", "fake-airline"], ["LIMIT", 1]]
UPDATE "airlines" SET "name" = $1, "updated_at" = $2 WHERE "airlines"."id" = $3  [["name", "lite airline"], ["updated_at", "2020-09-20 03:29:26.153304"], ["id", 7]]
---
			def update
				airline = Airline.find_by(slug: params[:slug])

				if airline.update(airline_params)

SELECT  "airlines".* FROM "airlines" WHERE "airlines"."slug" = $1 LIMIT $2  [["slug", "fake-airline"], ["LIMIT", 1]]
DELETE FROM "airlines" WHERE "airlines"."id" = $1  [["id", 7]]
---
			def destroy
				airline = Airline.find_by(slug: params[:slug])

				if airline.destroy