app/controllers/api/v1/reviews_controller.rb

			def create
				review = Review.new(review_params)

				if review.save
---
INSERT INTO "reviews" ("title", "description", "score", "airline_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"